def first_task():
    """
    1. Средствами языка Python сформировать текстовый файл (.txt), содержащий
    последовательность из целых положительных и отрицательных чисел. Сформировать
    новый текстовый файл (.txt) следующего вида, предварительно выполнив требуемую
    обработку элементов:

    Исходные данные:
    Количество элементов:
    Индекс последнего минимального элемента:
    Сумма элементов больших 10 во второй половине:
    """

    print('cnrwejhvbej')


if __name__ == '__main__':
    first_task()
