def first_task():
    """
    Дан целочисленный список размера 10. Вывести все содержащиеся в данном списе
    четные числа в порядке убывания их индексов, а также их количество K.
    """

    pass


def second_task():
    """
    Дан список размера N. Найти количество участков, на которых его элементы
    монотонно возрастают.
    """

    pass


def third_task():
    """
    Дан список размера N. Заменить каждый элемент списка на среднее арифметическое
    этого элемента и его соседей.
    """

    pass


def main():
    first_task()


if __name__ == '__main__':
    main()
