def first_task():
    """
    Составить программу, в которой функция построит изображение, в котором в
    первой строке 1 звездочка, во второй - 2, в третьей -3, ..., в строке с номером m - m
    звездочек.
    """

    pass


def second_task():
    """
    Описать функцию AddLeftDigit(D, K), добавляющую к целому положительному
    числу K слева цифру D (D — входной параметр целого типа, лежащий в диапазоне
    1-9, K — параметр целого типа, являющийся одновременно входным и выходным).
    С помощью этой функции последовательно добавить к данному числу K слева
    данные цифры D1 и D2, выводя результат каждого добавления.
    """

    pass


def main():
    first_task()


if __name__ == '__main__':
    main()
